Repository: ttiurani/troikalearning
Catalog: troikalearning/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: First Name *
fi: Etunimi *

source: Last Name *
fi: Sukunimi *

source: Email Address *
fi: Sähköpostiosoite *

source: Not a valid email address
fi: Sähköpostiosoite ei kelpaa

source: Password *
fi: Salasana *

source: Passwords must match
fi: Salasanojen pitää täsmätä

source: Repeat Password *
fi: Salasana uudelleen *

source: New Password
fi: Uusi salasana

source: Repeat New Password
fi: Uusi salasana uudelleen

source: Current Password *
fi: Nykyinen salasana *

source: Title *
fi: Otsikko *

source: Description *
fi: Kuvaus *

source: Language
fi: Kieli

source: Finnish
fi: suomi

source: English
fi: englanti

source: Swedish
fi: ruotsi

source: Address
fi: Osoite

source: Address Addendum
fi: Osoitteen lisätiedot

source: Start Date
fi: Aloituspäivämäärä

source: Start Time (hours, minutes)
fi: Aloitusajankohta (tunnit, minuutit)

source: Hours must be between 0 and 23
fi: Tuntien pitää olla välillä 0 ja 23

source: Start Time (min)
fi: Aloitusajankohta (min)

source: Minutes must be between 0 and 59
fi: Minuuttien pitää olla välillä 0 ja 59

source: Duration (min)
fi: Kesto (min)

source: Troika has to last at least one minute
fi: Troikan pitää kestää ainakin yksi minuutti

source: Max Participants
fi: Osanottajien yläraja

source: Minumum of three participants
fi: Vähintään kolme osallistujaa

source: Your role in the Troika
fi: Roolisi Troikassa

source: I will lead this
fi: Olen Troikan vetäjä

source: I want someone else to lead this
fi: Haluan, että joku muu on Troikan vetäjä

source: Share us your thoughts on Troika. What do you like? What could be improved?
fi: Kerro vapaasti mielipiteesi Troikasta. Mistä pidät? Mitä voisi parantaa?

source: Role
fi: Rooli

source: Troika Id
fi: Troikan Id

source: Email Address
fi: Sähköpostiosoite

source: New Password *
fi: Uusi salasana *

source: Repeat New Password *
fi: Uusi salasana uudelleen *

source: Invalid redirect target
fi: Virheellinen jälleenohjauskohde

source: Invalid language form
fi: Virheellinen kielilomake

source: You were logged in
fi: Kirjauduit sisään

source: Invalid email/password
fi: Virheellinen sähköposti tai salasana

source: User with given email or alias already exists
fi: Käyttäjä antamallasi sähköpostiosoitteella on jo olemassa

source: Registration successful, you were logged in
fi: Rekisteröinti onnistui, kirjauduit sisään

source: You need to login or register first
fi: Sinun pitää kirjautua tai rekisteröityä ensin

source: Could not find user with given email
fi: Käyttäjää ei löytynyt annetulla salasanalla

source: Troikalearning.org password reset
fi: Troikalearning.org: salasanan vaihto

source: Go to the following link to reset your password in the troikalearning.org website:
fi: Vaihtaaksesi salasanasi troikalearning.org -verkkopalveluun, mene seuraavaan osoitteeseen:

source: If you did not ask for your password to be reset, you can ignore this message.
fi: Jos et pyytänyt uutta salasanaa, voit sivuuttaa tämän viestin.

source: Password reset instructions sent to %(email)s
fi: Ohjeet salasanan vaihtoon lähetettiin osoitteeseen %(email)s

source: Invalid forgot form
fi: Virheellinen lomake

source: Invalid password reset link
fi: Virheellinen salasanan vaihto-osoite

source: Password reset successful, you were logged in
fi: Salasanan vaihto onnistui, kirjauduit sisään

source: Information updated
fi: Tiedot päivitetty

source: Invalid password
fi: Virheellinen salasana

source: Not set
fi: Ei asetettu

source: Invalid Troika Id
fi: Virheellinen Troikan Id

source: Can not invite to a completed Troika
fi: Ei voi kutsua jo pidettyyn Troikaan

source: Come join the Troika "%(title)s"!
fi: Liity Troikaan "%(title)s"!

source: %(user)s thought you should join the Troika "%(title)s":
fi: %(user)s haluaa, että liityt Troikaan "%(title)s":

source: the lead
fi: vetäjänä

source: Troika already has a lead
fi: Troikalla on jo vetäjä

source: the first learner
fi: ensimmäisenä oppijana

source: Troika already has a first learner
fi: Troikalla on jo ensimmäinen oppija

source: the second learner
fi: toisena oppijana

source: Troika already has a second learner
fi: Troikalla on jo toinen oppija

source: a participant
fi: osallistujana

source: Invalid role:
fi: Virheellinen rooli:

source: as %(role)s.
fi: %(role)s.

source: What do you say?
fi: Mitä olet mieltä?

source: Invite sent to %(email)s
fi: Kutsu lähetetty osoitteeseen %(email)s

source: Invalid invite form
fi: Virheellinen kutsulomake

source: Only the creator or the lead can edit the Troika
fi: Vain Troikan luoja tai vetäjä voi muokata Troikaa

source: Save Troika
fi: Tallenna Troika

source: When a date is set, you must also give values for hours, minutes and duration
fi: Kun päivämäärä on asetettu, sinun pitää myös antaa arvot tunneille, minuuteille ja kestolle

source: Start time for the Troika must be in the future
fi: Troikan alkuajankohta pitää olla tulevaisuudessa

source: Troika activated!
fi: Troika aktivoitu!

source: Troika saved
fi: Troika tallennettu

source: Delete Troika
fi: Poista Troika

source: Troika "%(title)s" deleted
fi: Troika "%(title)s" poistettu

source: Troika Team
fi: Troika-tiimi

source: Salla, Olli, Petro and Timo
fi: Salla, Olli, Petro ja Timo

source: Troika "%(title)s" activated!
fi: Troika "%(title)s" aktivoitu!

source: Congratulations! The Troika "%(title)s":
fi: Onnittelut! Troika "%(title)s":

source: has now been activated. You can view the participants on the Troika page.
fi: on nyt aktivoitu. Voit katsoa osallistujia Troikan sivulla.

source: Happy learnings!
fi: Hauskoja oppimishetkiä!

source: Troika "%(title)s" is just about to be born!
fi: Troika "%(title)s" on juuri syntymässä!

source: has now all three participants!
fi: on saanut kolme osallistujaa!

source: Your job now is to:
fi: Tehtävänänne on nyt:

source: 1. decide on the remaining open details for the Troika,
fi: 1. päättää lopuista avoimista asioista Troikassa.

source: 2. go to the Troika page and press "Edit Troika" (visible for the lead and creator),
fi: 2. mennä Troikan sivulle ja painaa "Muokkaa Troikaa" (näkyvillä Troikan luojalle ja vetäjälle)

source: 3. add the missing information and press "Save Troika".
fi: 3. lisätä puuttuvat tiedot ja painaa "Tallenna Troika".

source: Get going!
fi: Ei kun hommiin!

source: [insert inspirational quote about balalaikas here]
fi: [lisää tähän insiproiva lainaus balalaikoista]

source: Start time is in the past, change it before activating Troika
fi: Aloitusajankohta on menneisyydessä, muuta se ja yritä uudelleen

source: Troika %(title)s activated
fi: Troika %(title)s aktivoitu

source: Troika can only be activated by the creator or lead after all required information is set
fi: Troikan voi aktivoida vain sen luoja tai vetäjä, kun kaikki tarvittava informaatio on annettu

source: The Troika already has a lead
fi: Troikalla on jo vetäjä

source: You are now the lead of %(title)s
fi: Olet nyt vetäjä Troikassa %(title)s!

source: The Troika already has a first learner
fi: Troikalla on jo ensimmäinen oppija

source: You are now the first learner of %(title)s
fi: Olet nyt ensimmäinen oppija Troikassa %(title)s

source: The Troika already has a second learner
fi: Troikalla on jo toinen oppija

source: You are now the second learner of %(title)s
fi: Olet nyt toinen oppija Troikassa %(title)s

source: You are already participating in the Troika
fi: Osallistut jo Troikaan

source: There is no more room in this Troika
fi: Troikassa ei ole enää tilaa

source: You are now participating in %(title)s
fi: Osallistut nyt Troikaan %(title)s

source: Unknown Troika role: %(role)
fi: Tuntematon Troikan rooli: %(role)

source: You are not the lead of this Troika
fi: Et ole tämän Troikan vetäjä

source: You are no longer the lead of %(title)s
fi: Et ole enää vetäjä Troikassa %(title)s

source: You are not the first learner of this Troika
fi: Et ole ensimmäinen oppija tässä Troikassa

source: You are no longer the first learner of %(title)s
fi: Et ole enää ensimmäinen oppija Troikassa %(title)s

source: You are not the second learner of this Troika
fi: Et ole toinen oppija tässä Troikassa

source: You are no longer the second learner of %(title)s
fi: Et ole enää toinen oppija Troikassa %(title)s

source: You are not participating in the Troika
fi: Et osallistu Troikaan

source: You are no longer participating in %(title)s
fi: Et enää ole osallistujana Troikassa %(title)s

source: Unknown Troika role: %(role)s
fi: Tuntematon Troikan rooli: %(role)s

source: You can not leave a Troika that is complete
fi: Et voi poistua Troikasta joka on valmistunut

source: Troika Created
fi: Troika luotu

source: Feedback saved. Thank you!
fi: Palauteesi tallennettiin. Kiitos!

source: You were logged out
fi: Kirjauduit ulos

source: Home
fi: Etusivu

source: About
fi: Tietoa

source: Contents
fi: Sisällys

source: What Is Troika?
fi: Mikä on Troika?

source: How Does It Work?
fi: Kuinka Troika toimii?

source: Who are we?
fi: Keitä olemme?

source: Contact us
fi: Ota yhteyttä

source: Troika's mission is to empower people
fi: Troikan tehtävä on auttaa ihmisiä

source: to share and create new knowledge with each other. We want to remove common obstacles that usually prohibit this. We want to encourage people to recognize their own abilities, skills and knowledge.
fi: jakamaan ja luomaan uutta tietoa. Haluamme innostaa ihmisiä tunnistamaan heidän omat kykynsä ja tietonsa. Haluamme poistaa ne esteet, jotka tyypillisesti estävät tiedon jakamista tapahtumasta.

source: Troika is a hassle-free coordinator and organizer
fi: Troika auttaa koordinoimaan ja organisoimaan

source: for peer learning. Whether you want to share knowledge or receive it, Troika offers a platform where people can arrange peer learning events and spread the word of the event to other people interested in the topic.
fi: vertaisoppimisen tapahtumia. Jos haluat yhdistää ihmisiä tiedon äärelle, Troika tarjoaa alustan, jonka avulla voit järjestää tapahtumia ja viestiä niistä muille kiinnostuneille.

source: Troika's focus is on in-person meetings
fi: Troikan perusajatuksena on saada helposti aikaan fyysinen oppimistapahtuma

source: of three or more people. A "troika" means "of three". When three people get together at a Troika event, the organized Troika is considered a great success!
fi: kolmen tai useamman ihmisen kesken. "Troikka" tarkoittaa "kolmikkoa". Kun Troika-tapahtumaan osallistuu vähintään kolme ihmistä, on Troika onnistunut!

source: Three easy steps:
fi: Kolme helppoa askelta:

source: Discover a Topic.
fi: Keksi aihe.

source: Browse topics
fi: Selaa aiheita,

source: people have suggested as Troika events. Join a Troika that interests you either as a learner, participant or even lead. You are of course also welcome to
fi: joita muut käyttäjät ovat ehdottaneet Troikiksi. Osallistu sinua kiinnostavaan Troikaan joko oppijana, osallistujana tai jopa vetäjänä. Voit tietysti myös

source: create your own Troika
fi: luoda oman Troikan

source: Give your Troika event a title, a description, language and select your role in the Troika. If you want, you can also suggest a time and a place and set the maximum number of participants in the Troika. After the Troika is created, you can invite people to join your Troika on the Troika page, or just take a rest and wait for people to discover your Troika!
fi: Anna Troikallesi otsikko, kuvaus, kieli ja valitse roolisi Troikassa. Jos haluat, voit myös ehdottaa aikaa ja paikkaa ja asettaa osallistujien ylärajan. Kun Troika on luotu, voit Troikan sivulla kutsua mukaan ihmisiä, joiden haluaisit liittyvän luomaasi Troikaan, tai sitten vain otat rauhassa ja odotat, että ihmiset innostuvat Troikastasi!

source: Meet People.
fi: Tapaa ihmisiä.

source: When you and two other people have found each other in a Troika event, you will receive email from us containing the email addresses of the three of you. If all the details were given by the Troika creator, the Troika is now activated. If not, this is the time to agree on the remaining details and then add that information to the Troika event by pressing "Edit Troika" on the Troika page. After that other people will be able to join your Troika, limited of course by the maximum number of participants you have specified.
fi: Kun sinä ja kaksi muuta ihmistä olette löytäneet toisenne Troika-tapahtumassa, saatte meiltä sähköpostin, joka sisältää sähköpostiosoitteenne. Jos Troikan luoja antoi jo kaikki tarvittavat tiedot Troika-tapahtumasta, Troika on nyt aktiivinen. Jos tiedot olivat vielä vajaat, tässä vaiheessa teidän tulee päättää puuttuvista tiedoista ja lisätä ne Troika-tapahtumaan painamalla "Muokkaa Troikaa" Troikan sivulla. Tämän jälkeen myös muut voivat liittyä mukaan Troikaan asettamanne osallistujamäärän ylärajan mukaisesti.

source: Learn Stuff.
fi: Opi kaikenlaista.

source: Enjoy your Troika event and learn things from each other! Finally remember to spread the word about your Troika event for others to be encouraged and set up more Troikas to share their knowledge.
fi: Nauttikaa Troika-tapahtumasta ja oppikaa kaikenlaista uutta toisiltanne. Muistakaa kertoa Troikasta eteenpäin ja antaa palautetta tapahtumastanne, jotta muutkin innostuvat lisäämään omia Troikiaan tiedon jakamiseksi.

source: Troika is the brain child of Olli Parviainen, Petro Poutanen, Salla Laaksonen and Timo Tiuraniemi who also developed this site.
fi: Troika takana ovat Olli Parviainen, Petro Poutanen, Salla Laaksonen ja Timo Tiuraniemi, joka myös kehitti tämän sivuston.

source: Troika website is open source software developed under
fi: Troikan verkkosivut ovat avointa lähdekoodia. Lisenssinä on

source: Get the source code
fi: Tutustu lähdekoodiin

source: here
fi: täällä

source: Development of Troika is supported by
fi: Troikan kehitystä tukevat

source: and
fi: ja

source: Give instant feedback about Troika
fi: Anna heti palautetta Troikasta

source: For general questions about Troika, send email to
fi: Jos sinulla on yleisiä kysymyksiä Troikasta, lähetä sähköpostia osoiteeseen

source: For questions about this site, send email to
fi: Jos sinulla on kysymyksiä tästä sivustosta, lähetä sähköpostia osoitteeseen

source: Create
fi: Luo

source: Edit
fi: Muokkaa

source: When you fill up this form you will become a creator for a new pending Troika. The Troika will become active once two other participants have confirmed their attendance, you have agreed on time and place of the Troika, and either Troika is activated automatically or "Activate Troika" has been clicked.
fi: Kun täytät tämän lomakkeen, sinusta tulee uuden Troika-aihion luoja. Troikasta tulee aktiivinen, kun kaksi muuta käyttäjää ovat vahvistaneet osallistumisensa, ajasta ja paikasta on sovittu, ja joko Troika on aktivoitu automaattisesti tai "Aktivoi Troika" -linkkiä on klikattu.

source: Create Troika
fi: Luo Troika

source: Feedback
fi: Palaute

source: Anonymous
fi: Anonyymi

source: Save
fi: Tallenna

source: Login / Register
fi: Kirjaudu sisään / Rekisteröidy

source: Logout
fi: Kirjaudu ulos

source: Error
fi: Virhe

source: Give Feedback
fi: Anna palautetta

source: Login
fi: Kirjaudu sisään

source: Forgot password?
fi: Unohditko salasanasi?

source: Enter your email address
fi: Anna sähköpostiosoitteesi

source: Send reset email
fi: Lähetä ohjeet sähköpostilla

source: Register
fi: Rekisteröidy

source: Discover a Topic. Meet People. Learn Stuff.
fi: Keksi aihe. Tapaa ihmisiä. Opi kaikenlaista.

source: Hassle-Free Peer Learning
fi: Vertaisoppimista ilman häslinkiä

source: Alias to use instead of your real name. Set an alias only if you do not want your real name to be public on this web site.
fi: Alias jota käyttää oikean nimesi sijaan. Anna alias vain, jos et halua oikeaa nimeäsi näkyvän tällä sivustolla.

source: Send email
fi: Lähetä sähköpostia

source: Reset password
fi: Vaihda salasana

source: Reset Password
fi: Vaihda salasana

source: Save Password
fi: Tallenna salasana

source: Edit Troika
fi: Muokkaa Troikaa

source: Login or register to join Troika!
fi: Kirjaudu sisään tai rekisteröidy liittyäksesi Troikaan!

source: This Troika is currently full
fi: Troika on täynnä

source: Description
fi: Kuvaus

source: Status
fi: Vaihe

source: Active
fi: Aktiivinen

source: Pending
fi: Odotustilassa

source: Pending, huddle in progress
fi: Odotustilassa, järjestäytyminen meneillään

source: Complete
fi: Valmis

source: Start time
fi: Alkuajankohta

source: End time
fi: Loppuajankohta

source: Lead
fi: Vetäjä

source: Lead this Troika
fi: Ryhdy Troikan vetäjäksi

source: No one yet
fi: Ei kukaan vielä

source: Invite lead
fi: Kutsu vetäjä

source: Give the email address of the person you want to invite to lead.
fi: Anna sen henkilön sähköpostiosoite, jonka haluat kutsua Troikan vetäjäksi.

source: Leave this Troika
fi: Poistu Troikasta

source: First Learner
fi: Ensimmäinen oppija

source: Be the first learner in this Troika
fi: Liity Troikaan ensimmäiseksi oppijaksi

source: Invite first learner
fi: Kutsu ensimmäinen oppija

source: Give the email address of the person you want to invite to be the first learner.
fi: Anna sen henkilön sähköpostiosoite, jonka haluat kutsua Troikan ensimmäiseksi oppijaksi.

source: Second Learner
fi: Toinen oppija

source: Be the second learner in this Troika
fi: Liity Troikaan toiseksi oppijaksi

source: Invite second learner
fi: Kutsu toinen oppija

source: Give the email address of the person you want to invite to be the second learner.
fi: Anna sen henkilön sähköpostiosoite, jonka haluat kutsua Troikan toiseksi oppijaksi.

source: Participants
fi: Osallistujat

source: Participate in this Troika
fi: Osallistu tähän Troikaan

source: Invite participant
fi: Kutsu osallistuja

source: Give the email address of a person you want to invite to be participate in this Troika.
fi: Anna sen henkilön sähköpostiosoite, jonka haluat kutsua Troikan osallistujaksi.

source: Activate Troika
fi: Aktivoi Troika

source: Create a new Troika event
fi: Luo uusi Troika-tapahtuma

source: Active Troikas
fi: Aktiiviset Troikat

source: Upcoming Troikas you can join.
fi: Tulevat Troikat, joihin voit osallistua.

source: Unbelievable. No entries.
fi: Uskomatonta. Ei merkintöjä.

source: Pending Troikas
fi: Troika-aihiot

source: Suggested Troikas not yet activated. Check if you can help!
fi: Ehdotetut Troikat, joita ei ole vielä aktivoitu. Katso voitko auttaa!

source: Completed Troikas
fi: Valmistuneet Troikat

source: Succesfully held Troikas.
fi: Onnistuneesti pidetyt Troikat.

source: User Information
fi: Käyttäjätiedot

source: Update
fi: Päivitä
